{"weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [9216, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}], "paths": ["group1-shard1of2", "group1-shard2of2"]}], "modelTopology": {"model_config": {"config": [{"config": {"activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 32, "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "use_bias": true, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 64, "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 128, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "use_bias": true, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 10, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "keras_version": "2.1.6", "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "optimizer_config": {"config": {"rho": 0.95, "decay": 0.0, "lr": 1.0, "epsilon": 1e-07}, "class_name": "Adadelta"}, "sample_weight_mode": null}}}