{"modelTopology": {"backend": "tensorflow", "model_config": {"config": [{"config": {"activation": "relu", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "dtype": "float32", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "strides": [1, 1], "activity_regularizer": null, "filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "units": 128, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "seed": null, "noise_shape": null, "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "units": 10, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"loss_weights": null, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"config": {"decay": 0.0, "lr": 1.0, "rho": 0.95, "epsilon": 1e-07}, "class_name": "Adadelta"}}, "keras_version": "2.1.6"}, "weightsManifest": [{"weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [3, 3, 1, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}, {"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}, {"dtype": "float32", "name": "dense_1/kernel", "shape": [9216, 128]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [128]}, {"dtype": "float32", "name": "dense_2/kernel", "shape": [128, 10]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [10]}], "paths": ["group1-shard1of2", "group1-shard2of2"]}]}
